---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Field.GetSpecTypeId
source: html/cf09afe2-0bf6-0f90-52e5-5c305245538b.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field.GetSpecTypeId Method

Gets the spec describing the values stored in this field.

## Syntax (C#)
```csharp
public ForgeTypeId GetSpecTypeId()
```

## Returns
Identifier of the spec.